// 1049 数列的片段和 (20 分)
// 给定一个正数数列，我们可以从中截取任意的连续的几个数，称为片段。
// 例如，给定数列 { 0.1, 0.2, 0.3, 0.4 }，我们有
// (0.1) (0.1, 0.2) (0.1, 0.2, 0.3) (0.1, 0.2, 0.3, 0.4)
// (0.2) (0.2, 0.3) (0.2, 0.3, 0.4)
// (0.3) (0.3, 0.4)
// (0.4) 这 10 个片段。
// 给定正整数数列，求出全部片段包含的所有的数之和。
// 如本例中 10 个片段总和是 0.1 + 0.3 + 0.6 + 1.0 + 0.2 + 0.5 + 0.9 + 0.3 + 0.7 + 0.4 = 5.0。

#include <iostream>

int main()
{
    int N;
    std::cin >> N;
    double tmp = 0;
    long double sum = 0;

    for (int i = 0; i != N; ++i)
    {
        std::cin >> tmp;
        sum += tmp * (i + 1) * (N - i);
    }
    printf("%.2Lf", sum);
    return 0;
}